# 제어문(if)
# if 조건문:
#   조건문이 참인경우 실행문(True)
# else:
#   조건문이 참이 아닌경우 실행문(False)
#-------------------------------------------------------
# 블럭(block)
#   - indent(들여쓰기)를 구분
#   - 명령문의 콜론(:) 다음에 들여쓰기로 블럭 형성

#-------------------------------------------------------
# [비교연산자]
# 크다 : >
# 작다 : <
# 같다 : ==
# 같지 않다 : !=
# 크거나 같다 : >=
# 작거나 같다 : <=

# [논리 연산자]
# 논리합 : or
# 논리곱 : and
# 논리부정 : not

'''
(if문 형식)
if 조건식: 
    명령문
else 조건식:
    명령문
else:
    명령문
---------------------------------------
결과 = 참 if 조건식 else 거짓
'''